// © Copyright 2013, 2015-2016 HP Development Company, L.P.

// Task name & description
HSDTaskName = "Ustawienia serwera proxy";
HSDTaskDescription = "Drukarka obsługuje połączenie przez Internet. Jeśli do połączenia z Internetem jest używany serwer proxy, skonfiguruj poniższe ustawienia.";
TaskDescriptionInAssistantMode = "Aby połączyć się z Usługami WWW firmy HP, drukarka musi być podłączona do Internetu. W przypadku korzystania z serwera proxy do łączenia z Internetem wprowadź poniżej ustawienia.\n\nJeśli nie znasz ustawień serwera proxy, sprawdź je w okienku preferencji sieci lub skontaktuj się z administratorem systemu.";

// Radio buttons matrix
HSDProxyServerNotRequiredTitle = "Serwer proxy nie jest wymagany w celu połączenia z Internetem";
HSDAutomaticProxySettingsTitle = "Automatyczna (urządzenie automatycznie wykryje ustawienia)";
HSDCustomProxySettingsTitle = "Konfiguracja niestandardowa serwera proxy:";
HSDSystemProxySettingsTitle = "Kopiuj ustawienia systemu";

// Proxy server settings
HSDProxyServerTitle = "Serwer proxy:";
ProxyPortTitle = "Port serwera proxy:";

// Authentication
HSDRequiresAuthenticationButton = "Serwer proxy wymaga autoryzacji";
HSDUserNameTitle = "Nazwa użytkownika:";
HSDPasswordTitle = "Hasło:";

HSDApplyNowButtonTitle = "Zastosuj teraz";

// progress titles
UpdateInformationProcessTitle = "Aktualizowanie informacji...";

// alerts
EmptyProxyServerOrPortErrorText = "Należy podać serwer proxy oraz port proxy.";

EmptyUserNameOrPasswordErrorText = "Uwierzytelnianie przez serwer proxy wymaga podania nazwy użytkownika oraz hasła.";

IncorrectProxyServerNameFormatErrorText = "Nie można ustawić nazwy serwera proxy. Sprawdź, czy format jest poprawny.";

HSDUserNameTooLargeErrorText = "Nazwa użytkownika jest zbyt długa. Urządzenie obsługuje nazwy użytkownika o maksymalnej długości %d znaków.";
